7767517
122 158
Input                    images                   0 1 images -23330=4,3,416,416,3 0=416 1=416 2=3
Convolution              /model.0/conv/Conv       1 1 images /model.0/act/LeakyRelu_output_0 -23330=4,3,208,208,16 0=16 1=3 3=2 4=1 5=1 6=432 9=2 -23310=1,1.000000e-02
Convolution              /model.1/conv/Conv       1 1 /model.0/act/LeakyRelu_output_0 /model.1/act/LeakyRelu_output_0 -23330=4,3,104,104,32 0=32 1=3 3=2 4=1 5=1 6=4608 9=2 -23310=1,1.000000e-02
Convolution              /model.2/cv1/conv/Conv   1 1 /model.1/act/LeakyRelu_output_0 /model.2/cv1/act/LeakyRelu_output_0 -23330=4,3,104,104,32 0=32 1=1 5=1 6=1024 9=2 -23310=1,1.000000e-02
Slice                    /model.2/Split           1 2 /model.2/cv1/act/LeakyRelu_output_0 /model.2/Split_output_0 /model.2/Split_output_1 -23330=8,3,104,104,16,3,104,104,16 -23300=2,16,-233
Split                    splitncnn_0              1 3 /model.2/Split_output_1 /model.2/Split_output_1_splitncnn_0 /model.2/Split_output_1_splitncnn_1 /model.2/Split_output_1_splitncnn_2 -23330=12,3,104,104,16,3,104,104,16,3,104,104,16
Convolution              /model.2/m.0/cv1/conv/Conv 1 1 /model.2/Split_output_1_splitncnn_2 /model.2/m.0/cv1/act/LeakyRelu_output_0 -23330=4,3,104,104,16 0=16 1=3 4=1 5=1 6=2304 9=2 -23310=1,1.000000e-02
Convolution              /model.2/m.0/cv2/conv/Conv 1 1 /model.2/m.0/cv1/act/LeakyRelu_output_0 /model.2/m.0/cv2/act/LeakyRelu_output_0 -23330=4,3,104,104,16 0=16 1=3 4=1 5=1 6=2304 9=2 -23310=1,1.000000e-02
BinaryOp                 /model.2/m.0/Add         2 1 /model.2/Split_output_1_splitncnn_1 /model.2/m.0/cv2/act/LeakyRelu_output_0 /model.2/m.0/Add_output_0 -23330=4,3,104,104,16
Concat                   /model.2/Concat          3 1 /model.2/Split_output_0 /model.2/Split_output_1_splitncnn_0 /model.2/m.0/Add_output_0 /model.2/Concat_output_0 -23330=4,3,104,104,48
Convolution              /model.2/cv2/conv/Conv   1 1 /model.2/Concat_output_0 /model.2/cv2/act/LeakyRelu_output_0 -23330=4,3,104,104,32 0=32 1=1 5=1 6=1536 9=2 -23310=1,1.000000e-02
Convolution              /model.3/conv/Conv       1 1 /model.2/cv2/act/LeakyRelu_output_0 /model.3/act/LeakyRelu_output_0 -23330=4,3,52,52,64 0=64 1=3 3=2 4=1 5=1 6=18432 9=2 -23310=1,1.000000e-02
Convolution              /model.4/cv1/conv/Conv   1 1 /model.3/act/LeakyRelu_output_0 /model.4/cv1/act/LeakyRelu_output_0 -23330=4,3,52,52,64 0=64 1=1 5=1 6=4096 9=2 -23310=1,1.000000e-02
Slice                    /model.4/Split           1 2 /model.4/cv1/act/LeakyRelu_output_0 /model.4/Split_output_0 /model.4/Split_output_1 -23330=8,3,52,52,32,3,52,52,32 -23300=2,32,-233
Split                    splitncnn_1              1 3 /model.4/Split_output_1 /model.4/Split_output_1_splitncnn_0 /model.4/Split_output_1_splitncnn_1 /model.4/Split_output_1_splitncnn_2 -23330=12,3,52,52,32,3,52,52,32,3,52,52,32
Convolution              /model.4/m.0/cv1/conv/Conv 1 1 /model.4/Split_output_1_splitncnn_2 /model.4/m.0/cv1/act/LeakyRelu_output_0 -23330=4,3,52,52,32 0=32 1=3 4=1 5=1 6=9216 9=2 -23310=1,1.000000e-02
Convolution              /model.4/m.0/cv2/conv/Conv 1 1 /model.4/m.0/cv1/act/LeakyRelu_output_0 /model.4/m.0/cv2/act/LeakyRelu_output_0 -23330=4,3,52,52,32 0=32 1=3 4=1 5=1 6=9216 9=2 -23310=1,1.000000e-02
BinaryOp                 /model.4/m.0/Add         2 1 /model.4/Split_output_1_splitncnn_1 /model.4/m.0/cv2/act/LeakyRelu_output_0 /model.4/m.0/Add_output_0 -23330=4,3,52,52,32
Split                    splitncnn_2              1 3 /model.4/m.0/Add_output_0 /model.4/m.0/Add_output_0_splitncnn_0 /model.4/m.0/Add_output_0_splitncnn_1 /model.4/m.0/Add_output_0_splitncnn_2 -23330=12,3,52,52,32,3,52,52,32,3,52,52,32
Convolution              /model.4/m.1/cv1/conv/Conv 1 1 /model.4/m.0/Add_output_0_splitncnn_2 /model.4/m.1/cv1/act/LeakyRelu_output_0 -23330=4,3,52,52,32 0=32 1=3 4=1 5=1 6=9216 9=2 -23310=1,1.000000e-02
Convolution              /model.4/m.1/cv2/conv/Conv 1 1 /model.4/m.1/cv1/act/LeakyRelu_output_0 /model.4/m.1/cv2/act/LeakyRelu_output_0 -23330=4,3,52,52,32 0=32 1=3 4=1 5=1 6=9216 9=2 -23310=1,1.000000e-02
BinaryOp                 /model.4/m.1/Add         2 1 /model.4/m.0/Add_output_0_splitncnn_1 /model.4/m.1/cv2/act/LeakyRelu_output_0 /model.4/m.1/Add_output_0 -23330=4,3,52,52,32
Concat                   /model.4/Concat          4 1 /model.4/Split_output_0 /model.4/Split_output_1_splitncnn_0 /model.4/m.0/Add_output_0_splitncnn_0 /model.4/m.1/Add_output_0 /model.4/Concat_output_0 -23330=4,3,52,52,128
Convolution              /model.4/cv2/conv/Conv   1 1 /model.4/Concat_output_0 /model.4/cv2/act/LeakyRelu_output_0 -23330=4,3,52,52,64 0=64 1=1 5=1 6=8192 9=2 -23310=1,1.000000e-02
Split                    splitncnn_3              1 2 /model.4/cv2/act/LeakyRelu_output_0 /model.4/cv2/act/LeakyRelu_output_0_splitncnn_0 /model.4/cv2/act/LeakyRelu_output_0_splitncnn_1 -23330=8,3,52,52,64,3,52,52,64
Convolution              /model.5/conv/Conv       1 1 /model.4/cv2/act/LeakyRelu_output_0_splitncnn_1 /model.5/act/LeakyRelu_output_0 -23330=4,3,26,26,128 0=128 1=3 3=2 4=1 5=1 6=73728 9=2 -23310=1,1.000000e-02
Convolution              /model.6/cv1/conv/Conv   1 1 /model.5/act/LeakyRelu_output_0 /model.6/cv1/act/LeakyRelu_output_0 -23330=4,3,26,26,128 0=128 1=1 5=1 6=16384 9=2 -23310=1,1.000000e-02
Slice                    /model.6/Split           1 2 /model.6/cv1/act/LeakyRelu_output_0 /model.6/Split_output_0 /model.6/Split_output_1 -23330=8,3,26,26,64,3,26,26,64 -23300=2,64,-233
Split                    splitncnn_4              1 3 /model.6/Split_output_1 /model.6/Split_output_1_splitncnn_0 /model.6/Split_output_1_splitncnn_1 /model.6/Split_output_1_splitncnn_2 -23330=12,3,26,26,64,3,26,26,64,3,26,26,64
Convolution              /model.6/m.0/cv1/conv/Conv 1 1 /model.6/Split_output_1_splitncnn_2 /model.6/m.0/cv1/act/LeakyRelu_output_0 -23330=4,3,26,26,64 0=64 1=3 4=1 5=1 6=36864 9=2 -23310=1,1.000000e-02
Convolution              /model.6/m.0/cv2/conv/Conv 1 1 /model.6/m.0/cv1/act/LeakyRelu_output_0 /model.6/m.0/cv2/act/LeakyRelu_output_0 -23330=4,3,26,26,64 0=64 1=3 4=1 5=1 6=36864 9=2 -23310=1,1.000000e-02
BinaryOp                 /model.6/m.0/Add         2 1 /model.6/Split_output_1_splitncnn_1 /model.6/m.0/cv2/act/LeakyRelu_output_0 /model.6/m.0/Add_output_0 -23330=4,3,26,26,64
Split                    splitncnn_5              1 3 /model.6/m.0/Add_output_0 /model.6/m.0/Add_output_0_splitncnn_0 /model.6/m.0/Add_output_0_splitncnn_1 /model.6/m.0/Add_output_0_splitncnn_2 -23330=12,3,26,26,64,3,26,26,64,3,26,26,64
Convolution              /model.6/m.1/cv1/conv/Conv 1 1 /model.6/m.0/Add_output_0_splitncnn_2 /model.6/m.1/cv1/act/LeakyRelu_output_0 -23330=4,3,26,26,64 0=64 1=3 4=1 5=1 6=36864 9=2 -23310=1,1.000000e-02
Convolution              /model.6/m.1/cv2/conv/Conv 1 1 /model.6/m.1/cv1/act/LeakyRelu_output_0 /model.6/m.1/cv2/act/LeakyRelu_output_0 -23330=4,3,26,26,64 0=64 1=3 4=1 5=1 6=36864 9=2 -23310=1,1.000000e-02
BinaryOp                 /model.6/m.1/Add         2 1 /model.6/m.0/Add_output_0_splitncnn_1 /model.6/m.1/cv2/act/LeakyRelu_output_0 /model.6/m.1/Add_output_0 -23330=4,3,26,26,64
Concat                   /model.6/Concat          4 1 /model.6/Split_output_0 /model.6/Split_output_1_splitncnn_0 /model.6/m.0/Add_output_0_splitncnn_0 /model.6/m.1/Add_output_0 /model.6/Concat_output_0 -23330=4,3,26,26,256
Convolution              /model.6/cv2/conv/Conv   1 1 /model.6/Concat_output_0 /model.6/cv2/act/LeakyRelu_output_0 -23330=4,3,26,26,128 0=128 1=1 5=1 6=32768 9=2 -23310=1,1.000000e-02
Split                    splitncnn_6              1 2 /model.6/cv2/act/LeakyRelu_output_0 /model.6/cv2/act/LeakyRelu_output_0_splitncnn_0 /model.6/cv2/act/LeakyRelu_output_0_splitncnn_1 -23330=8,3,26,26,128,3,26,26,128
Convolution              /model.7/conv/Conv       1 1 /model.6/cv2/act/LeakyRelu_output_0_splitncnn_1 /model.7/act/LeakyRelu_output_0 -23330=4,3,13,13,256 0=256 1=3 3=2 4=1 5=1 6=294912 9=2 -23310=1,1.000000e-02
Convolution              /model.8/cv1/conv/Conv   1 1 /model.7/act/LeakyRelu_output_0 /model.8/cv1/act/LeakyRelu_output_0 -23330=4,3,13,13,256 0=256 1=1 5=1 6=65536 9=2 -23310=1,1.000000e-02
Slice                    /model.8/Split           1 2 /model.8/cv1/act/LeakyRelu_output_0 /model.8/Split_output_0 /model.8/Split_output_1 -23330=8,3,13,13,128,3,13,13,128 -23300=2,128,-233
Split                    splitncnn_7              1 3 /model.8/Split_output_1 /model.8/Split_output_1_splitncnn_0 /model.8/Split_output_1_splitncnn_1 /model.8/Split_output_1_splitncnn_2 -23330=12,3,13,13,128,3,13,13,128,3,13,13,128
Convolution              /model.8/m.0/cv1/conv/Conv 1 1 /model.8/Split_output_1_splitncnn_2 /model.8/m.0/cv1/act/LeakyRelu_output_0 -23330=4,3,13,13,128 0=128 1=3 4=1 5=1 6=147456 9=2 -23310=1,1.000000e-02
Convolution              /model.8/m.0/cv2/conv/Conv 1 1 /model.8/m.0/cv1/act/LeakyRelu_output_0 /model.8/m.0/cv2/act/LeakyRelu_output_0 -23330=4,3,13,13,128 0=128 1=3 4=1 5=1 6=147456 9=2 -23310=1,1.000000e-02
BinaryOp                 /model.8/m.0/Add         2 1 /model.8/Split_output_1_splitncnn_1 /model.8/m.0/cv2/act/LeakyRelu_output_0 /model.8/m.0/Add_output_0 -23330=4,3,13,13,128
Concat                   /model.8/Concat          3 1 /model.8/Split_output_0 /model.8/Split_output_1_splitncnn_0 /model.8/m.0/Add_output_0 /model.8/Concat_output_0 -23330=4,3,13,13,384
Convolution              /model.8/cv2/conv/Conv   1 1 /model.8/Concat_output_0 /model.8/cv2/act/LeakyRelu_output_0 -23330=4,3,13,13,256 0=256 1=1 5=1 6=98304 9=2 -23310=1,1.000000e-02
Convolution              /model.9/cv1/conv/Conv   1 1 /model.8/cv2/act/LeakyRelu_output_0 /model.9/cv1/act/LeakyRelu_output_0 -23330=4,3,13,13,128 0=128 1=1 5=1 6=32768 9=2 -23310=1,1.000000e-02
Split                    splitncnn_8              1 2 /model.9/cv1/act/LeakyRelu_output_0 /model.9/cv1/act/LeakyRelu_output_0_splitncnn_0 /model.9/cv1/act/LeakyRelu_output_0_splitncnn_1 -23330=8,3,13,13,128,3,13,13,128
Pooling                  /model.9/m/MaxPool       1 1 /model.9/cv1/act/LeakyRelu_output_0_splitncnn_1 /model.9/m/MaxPool_output_0 -23330=4,3,13,13,128 1=5 3=2 5=1
Split                    splitncnn_9              1 2 /model.9/m/MaxPool_output_0 /model.9/m/MaxPool_output_0_splitncnn_0 /model.9/m/MaxPool_output_0_splitncnn_1 -23330=8,3,13,13,128,3,13,13,128
Pooling                  /model.9/m_1/MaxPool     1 1 /model.9/m/MaxPool_output_0_splitncnn_1 /model.9/m_1/MaxPool_output_0 -23330=4,3,13,13,128 1=5 3=2 5=1
Split                    splitncnn_10             1 2 /model.9/m_1/MaxPool_output_0 /model.9/m_1/MaxPool_output_0_splitncnn_0 /model.9/m_1/MaxPool_output_0_splitncnn_1 -23330=8,3,13,13,128,3,13,13,128
Pooling                  /model.9/m_2/MaxPool     1 1 /model.9/m_1/MaxPool_output_0_splitncnn_1 /model.9/m_2/MaxPool_output_0 -23330=4,3,13,13,128 1=5 3=2 5=1
Concat                   /model.9/Concat          4 1 /model.9/cv1/act/LeakyRelu_output_0_splitncnn_0 /model.9/m/MaxPool_output_0_splitncnn_0 /model.9/m_1/MaxPool_output_0_splitncnn_0 /model.9/m_2/MaxPool_output_0 /model.9/Concat_output_0 -23330=4,3,13,13,512
Convolution              /model.9/cv2/conv/Conv   1 1 /model.9/Concat_output_0 /model.9/cv2/act/LeakyRelu_output_0 -23330=4,3,13,13,256 0=256 1=1 5=1 6=131072 9=2 -23310=1,1.000000e-02
Split                    splitncnn_11             1 2 /model.9/cv2/act/LeakyRelu_output_0 /model.9/cv2/act/LeakyRelu_output_0_splitncnn_0 /model.9/cv2/act/LeakyRelu_output_0_splitncnn_1 -23330=8,3,13,13,256,3,13,13,256
Interp                   /model.10/Resize         1 1 /model.9/cv2/act/LeakyRelu_output_0_splitncnn_1 /model.10/Resize_output_0 -23330=4,3,26,26,256 0=1 1=2.000000e+00 2=2.000000e+00
Concat                   /model.11/Concat         2 1 /model.10/Resize_output_0 /model.6/cv2/act/LeakyRelu_output_0_splitncnn_0 /model.11/Concat_output_0 -23330=4,3,26,26,384
Convolution              /model.12/cv1/conv/Conv  1 1 /model.11/Concat_output_0 /model.12/cv1/act/LeakyRelu_output_0 -23330=4,3,26,26,128 0=128 1=1 5=1 6=49152 9=2 -23310=1,1.000000e-02
Slice                    /model.12/Split          1 2 /model.12/cv1/act/LeakyRelu_output_0 /model.12/Split_output_0 /model.12/Split_output_1 -23330=8,3,26,26,64,3,26,26,64 -23300=2,64,-233
Split                    splitncnn_12             1 2 /model.12/Split_output_1 /model.12/Split_output_1_splitncnn_0 /model.12/Split_output_1_splitncnn_1 -23330=8,3,26,26,64,3,26,26,64
Convolution              /model.12/m.0/cv1/conv/Conv 1 1 /model.12/Split_output_1_splitncnn_1 /model.12/m.0/cv1/act/LeakyRelu_output_0 -23330=4,3,26,26,64 0=64 1=3 4=1 5=1 6=36864 9=2 -23310=1,1.000000e-02
Convolution              /model.12/m.0/cv2/conv/Conv 1 1 /model.12/m.0/cv1/act/LeakyRelu_output_0 /model.12/m.0/cv2/act/LeakyRelu_output_0 -23330=4,3,26,26,64 0=64 1=3 4=1 5=1 6=36864 9=2 -23310=1,1.000000e-02
Concat                   /model.12/Concat         3 1 /model.12/Split_output_0 /model.12/Split_output_1_splitncnn_0 /model.12/m.0/cv2/act/LeakyRelu_output_0 /model.12/Concat_output_0 -23330=4,3,26,26,192
Convolution              /model.12/cv2/conv/Conv  1 1 /model.12/Concat_output_0 /model.12/cv2/act/LeakyRelu_output_0 -23330=4,3,26,26,128 0=128 1=1 5=1 6=24576 9=2 -23310=1,1.000000e-02
Split                    splitncnn_13             1 2 /model.12/cv2/act/LeakyRelu_output_0 /model.12/cv2/act/LeakyRelu_output_0_splitncnn_0 /model.12/cv2/act/LeakyRelu_output_0_splitncnn_1 -23330=8,3,26,26,128,3,26,26,128
Interp                   /model.13/Resize         1 1 /model.12/cv2/act/LeakyRelu_output_0_splitncnn_1 /model.13/Resize_output_0 -23330=4,3,52,52,128 0=1 1=2.000000e+00 2=2.000000e+00
Concat                   /model.14/Concat         2 1 /model.13/Resize_output_0 /model.4/cv2/act/LeakyRelu_output_0_splitncnn_0 /model.14/Concat_output_0 -23330=4,3,52,52,192
Convolution              /model.15/cv1/conv/Conv  1 1 /model.14/Concat_output_0 /model.15/cv1/act/LeakyRelu_output_0 -23330=4,3,52,52,64 0=64 1=1 5=1 6=12288 9=2 -23310=1,1.000000e-02
Slice                    /model.15/Split          1 2 /model.15/cv1/act/LeakyRelu_output_0 /model.15/Split_output_0 /model.15/Split_output_1 -23330=8,3,52,52,32,3,52,52,32 -23300=2,32,-233
Split                    splitncnn_14             1 2 /model.15/Split_output_1 /model.15/Split_output_1_splitncnn_0 /model.15/Split_output_1_splitncnn_1 -23330=8,3,52,52,32,3,52,52,32
Convolution              /model.15/m.0/cv1/conv/Conv 1 1 /model.15/Split_output_1_splitncnn_1 /model.15/m.0/cv1/act/LeakyRelu_output_0 -23330=4,3,52,52,32 0=32 1=3 4=1 5=1 6=9216 9=2 -23310=1,1.000000e-02
Convolution              /model.15/m.0/cv2/conv/Conv 1 1 /model.15/m.0/cv1/act/LeakyRelu_output_0 /model.15/m.0/cv2/act/LeakyRelu_output_0 -23330=4,3,52,52,32 0=32 1=3 4=1 5=1 6=9216 9=2 -23310=1,1.000000e-02
Concat                   /model.15/Concat         3 1 /model.15/Split_output_0 /model.15/Split_output_1_splitncnn_0 /model.15/m.0/cv2/act/LeakyRelu_output_0 /model.15/Concat_output_0 -23330=4,3,52,52,96
Convolution              /model.15/cv2/conv/Conv  1 1 /model.15/Concat_output_0 /model.15/cv2/act/LeakyRelu_output_0 -23330=4,3,52,52,64 0=64 1=1 5=1 6=6144 9=2 -23310=1,1.000000e-02
Split                    splitncnn_15             1 3 /model.15/cv2/act/LeakyRelu_output_0 /model.15/cv2/act/LeakyRelu_output_0_splitncnn_0 /model.15/cv2/act/LeakyRelu_output_0_splitncnn_1 /model.15/cv2/act/LeakyRelu_output_0_splitncnn_2 -23330=12,3,52,52,64,3,52,52,64,3,52,52,64
Convolution              /model.16/conv/Conv      1 1 /model.15/cv2/act/LeakyRelu_output_0_splitncnn_2 /model.16/act/LeakyRelu_output_0 -23330=4,3,26,26,64 0=64 1=3 3=2 4=1 5=1 6=36864 9=2 -23310=1,1.000000e-02
Concat                   /model.17/Concat         2 1 /model.16/act/LeakyRelu_output_0 /model.12/cv2/act/LeakyRelu_output_0_splitncnn_0 /model.17/Concat_output_0 -23330=4,3,26,26,192
Convolution              /model.18/cv1/conv/Conv  1 1 /model.17/Concat_output_0 /model.18/cv1/act/LeakyRelu_output_0 -23330=4,3,26,26,128 0=128 1=1 5=1 6=24576 9=2 -23310=1,1.000000e-02
Slice                    /model.18/Split          1 2 /model.18/cv1/act/LeakyRelu_output_0 /model.18/Split_output_0 /model.18/Split_output_1 -23330=8,3,26,26,64,3,26,26,64 -23300=2,64,-233
Split                    splitncnn_16             1 2 /model.18/Split_output_1 /model.18/Split_output_1_splitncnn_0 /model.18/Split_output_1_splitncnn_1 -23330=8,3,26,26,64,3,26,26,64
Convolution              /model.18/m.0/cv1/conv/Conv 1 1 /model.18/Split_output_1_splitncnn_1 /model.18/m.0/cv1/act/LeakyRelu_output_0 -23330=4,3,26,26,64 0=64 1=3 4=1 5=1 6=36864 9=2 -23310=1,1.000000e-02
Convolution              /model.18/m.0/cv2/conv/Conv 1 1 /model.18/m.0/cv1/act/LeakyRelu_output_0 /model.18/m.0/cv2/act/LeakyRelu_output_0 -23330=4,3,26,26,64 0=64 1=3 4=1 5=1 6=36864 9=2 -23310=1,1.000000e-02
Concat                   /model.18/Concat         3 1 /model.18/Split_output_0 /model.18/Split_output_1_splitncnn_0 /model.18/m.0/cv2/act/LeakyRelu_output_0 /model.18/Concat_output_0 -23330=4,3,26,26,192
Convolution              /model.18/cv2/conv/Conv  1 1 /model.18/Concat_output_0 /model.18/cv2/act/LeakyRelu_output_0 -23330=4,3,26,26,128 0=128 1=1 5=1 6=24576 9=2 -23310=1,1.000000e-02
Split                    splitncnn_17             1 3 /model.18/cv2/act/LeakyRelu_output_0 /model.18/cv2/act/LeakyRelu_output_0_splitncnn_0 /model.18/cv2/act/LeakyRelu_output_0_splitncnn_1 /model.18/cv2/act/LeakyRelu_output_0_splitncnn_2 -23330=12,3,26,26,128,3,26,26,128,3,26,26,128
Convolution              /model.19/conv/Conv      1 1 /model.18/cv2/act/LeakyRelu_output_0_splitncnn_2 /model.19/act/LeakyRelu_output_0 -23330=4,3,13,13,128 0=128 1=3 3=2 4=1 5=1 6=147456 9=2 -23310=1,1.000000e-02
Concat                   /model.20/Concat         2 1 /model.19/act/LeakyRelu_output_0 /model.9/cv2/act/LeakyRelu_output_0_splitncnn_0 /model.20/Concat_output_0 -23330=4,3,13,13,384
Convolution              /model.21/cv1/conv/Conv  1 1 /model.20/Concat_output_0 /model.21/cv1/act/LeakyRelu_output_0 -23330=4,3,13,13,256 0=256 1=1 5=1 6=98304 9=2 -23310=1,1.000000e-02
Slice                    /model.21/Split          1 2 /model.21/cv1/act/LeakyRelu_output_0 /model.21/Split_output_0 /model.21/Split_output_1 -23330=8,3,13,13,128,3,13,13,128 -23300=2,128,-233
Split                    splitncnn_18             1 2 /model.21/Split_output_1 /model.21/Split_output_1_splitncnn_0 /model.21/Split_output_1_splitncnn_1 -23330=8,3,13,13,128,3,13,13,128
Convolution              /model.21/m.0/cv1/conv/Conv 1 1 /model.21/Split_output_1_splitncnn_1 /model.21/m.0/cv1/act/LeakyRelu_output_0 -23330=4,3,13,13,128 0=128 1=3 4=1 5=1 6=147456 9=2 -23310=1,1.000000e-02
Convolution              /model.21/m.0/cv2/conv/Conv 1 1 /model.21/m.0/cv1/act/LeakyRelu_output_0 /model.21/m.0/cv2/act/LeakyRelu_output_0 -23330=4,3,13,13,128 0=128 1=3 4=1 5=1 6=147456 9=2 -23310=1,1.000000e-02
Concat                   /model.21/Concat         3 1 /model.21/Split_output_0 /model.21/Split_output_1_splitncnn_0 /model.21/m.0/cv2/act/LeakyRelu_output_0 /model.21/Concat_output_0 -23330=4,3,13,13,384
Convolution              /model.21/cv2/conv/Conv  1 1 /model.21/Concat_output_0 /model.21/cv2/act/LeakyRelu_output_0 -23330=4,3,13,13,256 0=256 1=1 5=1 6=98304 9=2 -23310=1,1.000000e-02
Split                    splitncnn_19             1 2 /model.21/cv2/act/LeakyRelu_output_0 /model.21/cv2/act/LeakyRelu_output_0_splitncnn_0 /model.21/cv2/act/LeakyRelu_output_0_splitncnn_1 -23330=8,3,13,13,256,3,13,13,256
Convolution              /model.22/cv2.0/cv2.0.0/conv/Conv 1 1 /model.15/cv2/act/LeakyRelu_output_0_splitncnn_1 /model.22/cv2.0/cv2.0.0/act/LeakyRelu_output_0 -23330=4,3,52,52,64 0=64 1=3 4=1 5=1 6=36864 9=2 -23310=1,1.000000e-02
Convolution              /model.22/cv2.0/cv2.0.1/conv/Conv 1 1 /model.22/cv2.0/cv2.0.0/act/LeakyRelu_output_0 /model.22/cv2.0/cv2.0.1/act/LeakyRelu_output_0 -23330=4,3,52,52,64 0=64 1=3 4=1 5=1 6=36864 9=2 -23310=1,1.000000e-02
Convolution              /model.22/cv2.0/cv2.0.2/Conv 1 1 /model.22/cv2.0/cv2.0.1/act/LeakyRelu_output_0 /model.22/cv2.0/cv2.0.2/Conv_output_0 -23330=4,3,52,52,64 0=64 1=1 5=1 6=4096
Convolution              /model.22/cv3.0/cv3.0.0/conv/Conv 1 1 /model.15/cv2/act/LeakyRelu_output_0_splitncnn_0 /model.22/cv3.0/cv3.0.0/act/LeakyRelu_output_0 -23330=4,3,52,52,64 0=64 1=3 4=1 5=1 6=36864 9=2 -23310=1,1.000000e-02
Convolution              /model.22/cv3.0/cv3.0.1/conv/Conv 1 1 /model.22/cv3.0/cv3.0.0/act/LeakyRelu_output_0 /model.22/cv3.0/cv3.0.1/act/LeakyRelu_output_0 -23330=4,3,52,52,64 0=64 1=3 4=1 5=1 6=36864 9=2 -23310=1,1.000000e-02
Convolution              /model.22/cv3.0/cv3.0.2/Conv 1 1 /model.22/cv3.0/cv3.0.1/act/LeakyRelu_output_0 /model.22/cv3.0/cv3.0.2/Conv_output_0 -23330=4,3,52,52,1 0=1 1=1 5=1 6=64
Concat                   /model.22/Concat         2 1 /model.22/cv2.0/cv2.0.2/Conv_output_0 /model.22/cv3.0/cv3.0.2/Conv_output_0 /model.22/Concat_output_0 -23330=4,3,52,52,65
Convolution              /model.22/cv2.1/cv2.1.0/conv/Conv 1 1 /model.18/cv2/act/LeakyRelu_output_0_splitncnn_1 /model.22/cv2.1/cv2.1.0/act/LeakyRelu_output_0 -23330=4,3,26,26,64 0=64 1=3 4=1 5=1 6=73728 9=2 -23310=1,1.000000e-02
Convolution              /model.22/cv2.1/cv2.1.1/conv/Conv 1 1 /model.22/cv2.1/cv2.1.0/act/LeakyRelu_output_0 /model.22/cv2.1/cv2.1.1/act/LeakyRelu_output_0 -23330=4,3,26,26,64 0=64 1=3 4=1 5=1 6=36864 9=2 -23310=1,1.000000e-02
Convolution              /model.22/cv2.1/cv2.1.2/Conv 1 1 /model.22/cv2.1/cv2.1.1/act/LeakyRelu_output_0 /model.22/cv2.1/cv2.1.2/Conv_output_0 -23330=4,3,26,26,64 0=64 1=1 5=1 6=4096
Convolution              /model.22/cv3.1/cv3.1.0/conv/Conv 1 1 /model.18/cv2/act/LeakyRelu_output_0_splitncnn_0 /model.22/cv3.1/cv3.1.0/act/LeakyRelu_output_0 -23330=4,3,26,26,64 0=64 1=3 4=1 5=1 6=73728 9=2 -23310=1,1.000000e-02
Convolution              /model.22/cv3.1/cv3.1.1/conv/Conv 1 1 /model.22/cv3.1/cv3.1.0/act/LeakyRelu_output_0 /model.22/cv3.1/cv3.1.1/act/LeakyRelu_output_0 -23330=4,3,26,26,64 0=64 1=3 4=1 5=1 6=36864 9=2 -23310=1,1.000000e-02
Convolution              /model.22/cv3.1/cv3.1.2/Conv 1 1 /model.22/cv3.1/cv3.1.1/act/LeakyRelu_output_0 /model.22/cv3.1/cv3.1.2/Conv_output_0 -23330=4,3,26,26,1 0=1 1=1 5=1 6=64
Concat                   /model.22/Concat_1       2 1 /model.22/cv2.1/cv2.1.2/Conv_output_0 /model.22/cv3.1/cv3.1.2/Conv_output_0 /model.22/Concat_1_output_0 -23330=4,3,26,26,65
Convolution              /model.22/cv2.2/cv2.2.0/conv/Conv 1 1 /model.21/cv2/act/LeakyRelu_output_0_splitncnn_1 /model.22/cv2.2/cv2.2.0/act/LeakyRelu_output_0 -23330=4,3,13,13,64 0=64 1=3 4=1 5=1 6=147456 9=2 -23310=1,1.000000e-02
Convolution              /model.22/cv2.2/cv2.2.1/conv/Conv 1 1 /model.22/cv2.2/cv2.2.0/act/LeakyRelu_output_0 /model.22/cv2.2/cv2.2.1/act/LeakyRelu_output_0 -23330=4,3,13,13,64 0=64 1=3 4=1 5=1 6=36864 9=2 -23310=1,1.000000e-02
Convolution              /model.22/cv2.2/cv2.2.2/Conv 1 1 /model.22/cv2.2/cv2.2.1/act/LeakyRelu_output_0 /model.22/cv2.2/cv2.2.2/Conv_output_0 -23330=4,3,13,13,64 0=64 1=1 5=1 6=4096
Convolution              /model.22/cv3.2/cv3.2.0/conv/Conv 1 1 /model.21/cv2/act/LeakyRelu_output_0_splitncnn_0 /model.22/cv3.2/cv3.2.0/act/LeakyRelu_output_0 -23330=4,3,13,13,64 0=64 1=3 4=1 5=1 6=147456 9=2 -23310=1,1.000000e-02
Convolution              /model.22/cv3.2/cv3.2.1/conv/Conv 1 1 /model.22/cv3.2/cv3.2.0/act/LeakyRelu_output_0 /model.22/cv3.2/cv3.2.1/act/LeakyRelu_output_0 -23330=4,3,13,13,64 0=64 1=3 4=1 5=1 6=36864 9=2 -23310=1,1.000000e-02
Convolution              /model.22/cv3.2/cv3.2.2/Conv 1 1 /model.22/cv3.2/cv3.2.1/act/LeakyRelu_output_0 /model.22/cv3.2/cv3.2.2/Conv_output_0 -23330=4,3,13,13,1 0=1 1=1 5=1 6=64
Concat                   /model.22/Concat_2       2 1 /model.22/cv2.2/cv2.2.2/Conv_output_0 /model.22/cv3.2/cv3.2.2/Conv_output_0 /model.22/Concat_2_output_0 -23330=4,3,13,13,65
Permute                  /model.22/Transpose      1 1 /model.22/Concat_output_0 output0 -23330=4,3,65,52,52 0=3
Permute                  /model.22/Transpose_1    1 1 /model.22/Concat_1_output_0 output1 -23330=4,3,65,26,26 0=3
Permute                  /model.22/Transpose_2    1 1 /model.22/Concat_2_output_0 output2 -23330=4,3,65,13,13 0=3
